article/lang/lisp/schemeAccessCLibrary.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>ChezScheme 调用 C 库</title>
<!-- 2016-12-09 Fri 11:04 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="[[mailto:pengwenbin7@126.com][pengwenbin7]]pengwenbin7" />
<meta name="viewport" content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
<link href="https://cdn.bootcss.com/bootstrap/3.3.6/css/bootstrap.min.css" rel="stylesheet">
<link rel="stylesheet" href="https://pengwenbin7.github.io/static/css/article.css">
</head>
<body>
<div id="content">
<h1 class="title">ChezScheme 调用 C 库</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 调用标准库</a></li>
<li><a href="#sec-2">2. 数据类型</a>
<ul>
<li><a href="#sec-2-1">2.1. 基本类型</a></li>
<li><a href="#sec-2-2">2.2. C 扩展类型</a></li>
<li><a href="#sec-2-3">2.3. Scheme 扩展</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 参考</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 调用标准库</h2>
<div class="outline-text-2" id="text-1">
<p>
系统环境： <code>ubuntu 16.04</code> + <code>ChezScheme 9.4</code> + <code>gcc 5.4.0</code>
</p>
<div class="org-src-container">

<pre class="src src-scheme">(load-shared-object <span style="color: #e67128;">"libc.so.6"</span>) <span style="color: #74af68;">;; </span><span style="color: #74af68;">&#35843;&#29992; C &#24235;</span>
((foreign-procedure <span style="color: #e67128;">"strlen"</span> (string) int) <span style="color: #e67128;">"nice"</span>) <span style="color: #74af68;">;; </span><span style="color: #74af68;">&#21311;&#21517;&#20989;&#25968;&#35843;&#29992;, output: 4</span>
(<span style="color: #ffad29; font-weight: bold;">define</span> <span style="color: #00ede1; font-weight: bold;">strlen</span> (foreign-procedure <span style="color: #e67128;">"strlen"</span> (string) int)) <span style="color: #74af68;">;; </span><span style="color: #74af68;">&#23450;&#20041; Scheme &#20989;&#25968;</span>
(strlen <span style="color: #e67128;">"&#20013;&#22269;"</span>) <span style="color: #74af68;">;; </span><span style="color: #74af68;">output: 6, &#40664;&#35748;&#37319;&#29992; UTF-8 &#32534;&#30721;&#65292;&#20004;&#20010;&#27721;&#23383;&#38271;&#24230;&#20026;6</span>
</pre>
</div>

<p>
<code>(load-shared-object "libc.so.6")</code> 载入动态链接库，可以写绝对地址，否则在系统默认目录里面搜索。
当前目录不在搜索范围内，当前目录下的库要写成 <code>./lib.so</code> 。
</p>

<p>
<code>(foreign-procedure 函数名 (参数1类型 参数2类型 ...) 返回值类型)</code> , 
<code>foreign-procedure</code> 返回函数
</p>

<p>
<code>(foreign-entry? "strlen")</code> 外部函数 <code>strlen</code> 是否存在，返回 <code>#t</code> 或 =#f=。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 数据类型</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 基本类型</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C</td>
<td class="left">Scheme</td>
</tr>

<tr>
<td class="left">char</td>
<td class="left">integer-8</td>
</tr>

<tr>
<td class="left">int</td>
<td class="left">int</td>
</tr>

<tr>
<td class="left">float</td>
<td class="left">float</td>
</tr>

<tr>
<td class="left">double</td>
<td class="left">double</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> C 扩展类型</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C</td>
<td class="left">Scheme</td>
</tr>

<tr>
<td class="left">short</td>
<td class="left">short</td>
</tr>

<tr>
<td class="left">long</td>
<td class="left">long</td>
</tr>

<tr>
<td class="left">unsigned char</td>
<td class="left">octet/char</td>
</tr>

<tr>
<td class="left">unsigned short</td>
<td class="left">unsigned-short</td>
</tr>

<tr>
<td class="left">unsigned long</td>
<td class="left">unsigned-long</td>
</tr>

<tr>
<td class="left">wchar_t</td>
<td class="left">wchar_t</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Scheme 扩展</h3>
<div class="outline-text-3" id="text-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C</td>
<td class="left">Scheme</td>
</tr>

<tr>
<td class="left">void *</td>
<td class="left">uptr/void*</td>
</tr>

<tr>
<td class="left">0</td>
<td class="left">boolean(#f)</td>
</tr>

<tr>
<td class="left">!0</td>
<td class="left">boolean(#t)</td>
</tr>

<tr>
<td class="left">size_t</td>
<td class="left">size_t</td>
</tr>

<tr>
<td class="left">void</td>
<td class="left">void</td>
</tr>

<tr>
<td class="left">unsigned char *</td>
<td class="left">utf-8/string</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 参考</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://cisco.github.io/ChezScheme/csug9.4/foreign.html">ChezScheme document</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: <a href="mailto:pengwenbin7@126.com">pengwenbin7</a></p>
<p class="date">Created: 2016-12-09 Fri 11:04</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
